<template>
  <div class='app'>
    <FullCalendar :options='calendarOptions'/>
  </div>
</template>

<script>
import FullCalendar from '@fullcalendar/vue'
import interactionPlugin from '@fullcalendar/interaction'
import timeGridPlugin from '@fullcalendar/timegrid'

export default {
  components: {
    FullCalendar
  },
  async asyncData({$axios, params}) {
    const lessons = await $axios.$get(`lessons`)
    const events = []
    lessons.forEach(l => {
      events.push({title: l.lesson, date: l.dtStart})
    })
    console.log(events)
    return {}
  },
  data() {
    return {
      calendarOptions: {
        plugins: [interactionPlugin, timeGridPlugin],
        initialView: 'timeGridWeek',
        nowIndicator: true,
        editable: true,
        initialEvents: [
          {title: 'nice event', start: new Date()}
        ],
        events: [
          {title: 'Урок физики', date: '2022-04-01 10:15'},
          {title: 'Урок физики ч.1', date: '2022-04-04 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-04 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-04 11:00'},
          {title: 'Урок физики ч.1', date: '2022-04-04 12:00'},
          {title: 'Урок физики ч.1', date: '2022-04-04 13:00'},
          {title: 'Урок физики ч.1', date: '2022-04-11 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-11 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-11 11:00'},
          {title: 'Урок физики ч.1', date: '2022-04-11 12:00'},
          {title: 'Урок физики ч.1', date: '2022-04-11 13:00'},
          {title: 'Урок физики ч.1', date: '2022-04-18 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-18 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-18 11:00'},
          {title: 'Урок физики ч.1', date: '2022-04-18 12:00'},
          {title: 'Урок физики ч.1', date: '2022-04-18 13:00'},
          {title: 'Урок физики ч.1', date: '2022-04-25 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-25 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-25 11:00'},
          {title: 'Урок физики ч.1', date: '2022-04-25 12:00'},
          {title: 'Урок физики ч.1', date: '2022-04-25 13:00'},
          {title: 'Урок физики ч.1', date: '2022-04-06 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-06 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-06 11:00'},
          {title: 'Урок физики ч.1', date: '2022-04-06 12:00'},
          {title: 'Урок физики ч.1', date: '2022-04-13 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-13 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-13 11:00'},
          {title: 'Урок физики ч.1', date: '2022-04-13 12:00'},
          {title: 'Урок физики ч.1', date: '2022-04-20 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-20 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-20 11:00'},
          {title: 'Урок физики ч.1', date: '2022-04-20 12:00'},
          {title: 'Урок физики ч.1', date: '2022-04-27 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-27 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-27 11:00'},
          {title: 'Урок физики ч.1', date: '2022-04-27 12:00'},
          {title: 'Урок физики ч.1', date: '2022-04-01 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-01 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-01 11:00'},
          {title: 'Урок физики ч.1', date: '2022-04-08 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-08 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-08 11:00'},
          {title: 'Урок физики ч.1', date: '2022-04-15 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-15 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-15 11:00'},
          {title: 'Урок физики ч.1', date: '2022-04-22 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-22 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-22 11:00'},
          {title: 'Урок физики ч.1', date: '2022-04-29 09:00'},
          {title: 'Урок физики ч.1', date: '2022-04-29 10:00'},
          {title: 'Урок физики ч.1', date: '2022-04-29 11:00'},
          {title: 'Урок химии', date: '2022-04-05 10:00'},
          {title: 'Урок химии', date: '2022-04-05 10:50'},
          {title: 'Урок химии', date: '2022-04-05 11:40'},
          {title: 'Урок химии', date: '2022-04-05 12:30'},
          {title: 'Урок химии', date: '2022-04-12 10:00'},
          {title: 'Урок химии', date: '2022-04-12 10:50'},
          {title: 'Урок химии', date: '2022-04-12 11:40'},
          {title: 'Урок химии', date: '2022-04-12 12:30'},
          {title: 'Урок химии', date: '2022-04-19 10:00'},
          {title: 'Урок химии', date: '2022-04-19 10:50'},
          {title: 'Урок химии', date: '2022-04-19 11:40'},
          {title: 'Урок химии', date: '2022-04-19 12:30'},
          {title: 'Урок химии', date: '2022-04-26 10:00'},
          {title: 'Урок химии', date: '2022-04-26 10:50'},
          {title: 'Урок химии', date: '2022-04-26 11:40'},
          {title: 'Урок химии', date: '2022-04-26 12:30'},
          {title: 'Урок химии', date: '2022-04-07 10:00'},
          {title: 'Урок химии', date: '2022-04-07 10:50'},
          {title: 'Урок химии', date: '2022-04-07 11:40'},
          {title: 'Урок химии', date: '2022-04-07 12:30'},
          {title: 'Урок химии', date: '2022-04-14 10:00'},
          {title: 'Урок химии', date: '2022-04-14 10:50'},
          {title: 'Урок химии', date: '2022-04-14 11:40'},
          {title: 'Урок химии', date: '2022-04-14 12:30'},
          {title: 'Урок химии', date: '2022-04-21 10:00'},
          {title: 'Урок химии', date: '2022-04-21 10:50'},
          {title: 'Урок химии', date: '2022-04-21 11:40'},
          {title: 'Урок химии', date: '2022-04-21 12:30'},
          {title: 'Урок химии', date: '2022-04-28 10:00'},
          {title: 'Урок химии', date: '2022-04-28 10:50'},
          {title: 'Урок химии', date: '2022-04-28 11:40'},
          {title: 'Урок химии', date: '2022-04-28 12:30'},
          {title: 'Урок психологии', date: '2022-04-04 12:00'},
          {title: 'Урок психологии', date: '2022-04-04 12:40'},
          {title: 'Урок психологии', date: '2022-04-04 13:20'},
          {title: 'Урок психологии', date: '2022-04-11 12:00'},
          {title: 'Урок психологии', date: '2022-04-11 12:40'},
          {title: 'Урок психологии', date: '2022-04-11 13:20'},
          {title: 'Урок психологии', date: '2022-04-18 12:00'},
          {title: 'Урок психологии', date: '2022-04-18 12:40'},
          {title: 'Урок психологии', date: '2022-04-18 13:20'},
          {title: 'Урок психологии', date: '2022-04-25 12:00'},
          {title: 'Урок психологии', date: '2022-04-25 12:40'},
          {title: 'Урок психологии', date: '2022-04-25 13:20'},
          {title: 'Урок психологии', date: '2022-04-06 10:00'},
          {title: 'Урок психологии', date: '2022-04-06 10:40'},
          {title: 'Урок психологии', date: '2022-04-06 11:20'},
          {title: 'Урок психологии', date: '2022-04-06 12:00'},
          {title: 'Урок психологии', date: '2022-04-06 12:40'},
          {title: 'Урок психологии', date: '2022-04-13 10:00'},
          {title: 'Урок психологии', date: '2022-04-13 10:40'},
          {title: 'Урок психологии', date: '2022-04-13 11:20'},
          {title: 'Урок психологии', date: '2022-04-13 12:00'},
          {title: 'Урок психологии', date: '2022-04-13 12:40'},
          {title: 'Урок психологии', date: '2022-04-20 10:00'},
          {title: 'Урок психологии', date: '2022-04-20 10:40'},
          {title: 'Урок психологии', date: '2022-04-20 11:20'},
          {title: 'Урок психологии', date: '2022-04-20 12:00'},
          {title: 'Урок психологии', date: '2022-04-20 12:40'},
          {title: 'Урок психологии', date: '2022-04-27 10:00'},
          {title: 'Урок психологии', date: '2022-04-27 10:40'},
          {title: 'Урок психологии', date: '2022-04-27 11:20'},
          {title: 'Урок психологии', date: '2022-04-27 12:00'},
          {title: 'Урок психологии', date: '2022-04-27 12:40'},
          {title: 'Урок психологии', date: '2022-04-01 10:00'},
          {title: 'Урок психологии', date: '2022-04-01 10:40'},
          {title: 'Урок психологии', date: '2022-04-01 11:20'},
          {title: 'Урок психологии', date: '2022-04-01 12:00'},
          {title: 'Урок психологии', date: '2022-04-01 12:40'},
          {title: 'Урок психологии', date: '2022-04-08 10:00'},
          {title: 'Урок психологии', date: '2022-04-08 10:40'},
          {title: 'Урок психологии', date: '2022-04-08 11:20'},
          {title: 'Урок психологии', date: '2022-04-08 12:00'},
          {title: 'Урок психологии', date: '2022-04-08 12:40'},
          {title: 'Урок психологии', date: '2022-04-15 10:00'},
          {title: 'Урок психологии', date: '2022-04-15 10:40'},
          {title: 'Урок психологии', date: '2022-04-15 11:20'},
          {title: 'Урок психологии', date: '2022-04-15 12:00'},
          {title: 'Урок психологии', date: '2022-04-15 12:40'},
          {title: 'Урок психологии', date: '2022-04-22 10:00'},
          {title: 'Урок психологии', date: '2022-04-22 10:40'},
          {title: 'Урок психологии', date: '2022-04-22 11:20'},
          {title: 'Урок психологии', date: '2022-04-22 12:00'},
          {title: 'Урок психологии', date: '2022-04-22 12:40'},
          {title: 'Урок психологии', date: '2022-04-29 10:00'},
          {title: 'Урок психологии', date: '2022-04-29 10:40'},
          {title: 'Урок психологии', date: '2022-04-29 11:20'},
          {title: 'Урок психологии', date: '2022-04-29 12:00'},
          {title: 'Урок психологии', date: '2022-04-29 12:40'},
          {title: 'Урок математики', date: '2022-04-05 14:00'},
          {title: 'Урок математики', date: '2022-04-05 14:55'},
          {title: 'Урок математики', date: '2022-04-05 15:50'},
          {title: 'Урок математики', date: '2022-04-12 14:00'},
          {title: 'Урок математики', date: '2022-04-12 14:55'},
          {title: 'Урок математики', date: '2022-04-12 15:50'},
          {title: 'Урок математики', date: '2022-04-19 14:00'},
          {title: 'Урок математики', date: '2022-04-19 14:55'},
          {title: 'Урок математики', date: '2022-04-19 15:50'},
          {title: 'Урок математики', date: '2022-04-26 14:00'},
          {title: 'Урок математики', date: '2022-04-26 14:55'},
          {title: 'Урок математики', date: '2022-04-26 15:50'},
          {title: 'Урок математики', date: '2022-04-07 14:00'},
          {title: 'Урок математики', date: '2022-04-07 14:55'},
          {title: 'Урок математики', date: '2022-04-07 15:50'},
          {title: 'Урок математики', date: '2022-04-14 14:00'},
          {title: 'Урок математики', date: '2022-04-14 14:55'},
          {title: 'Урок математики', date: '2022-04-14 15:50'},
          {title: 'Урок математики', date: '2022-04-21 14:00'},
          {title: 'Урок математики', date: '2022-04-21 14:55'},
          {title: 'Урок математики', date: '2022-04-21 15:50'},
          {title: 'Урок математики', date: '2022-04-28 14:00'},
          {title: 'Урок математики', date: '2022-04-28 14:55'},
          {title: 'Урок математики', date: '2022-04-28 15:50'}
        ]
      }
    }
  }
}
</script>

<style scoped>
.app {
  font-family: Arial, Helvetica Neue, Helvetica, sans-serif;
  font-size: 14px;
}
</style>
